const nicknameModifiers = [
  '마못찐', '하는', '갤질 중독인', '봌안분인', '위험한', '얀데레', '츤데레', '새드 걸',
  '귀여운', '히키코모리', '헬창', '학대 마려운', '건전한', '불건전한', '지듣노 낚시하는',
  '하꼬성애자', '감성적인', '백수', '텅텅 마려운', '어두운', '무서운', '야한',
  '목조르는', '이상한', '실패작인', '윤회하는', '아재개그하는', '요염한', '거유', '빈유',
  '음란한', '엣찌한', '천박한', '조용한', '시끄러운', '개초딩', '상냥한', '진지한',
  '따뜻한', '냉각이 필요한', '로봇', '무시무시한', '사랑스러운', '사랑하는', '착한', '나쁜',
  '노래하는', '노래 안하는', '일본인', '한국인', '중국인', '미국인', '징집된', '순한',
  '완벽한', '한국에 온', '일본을 떠난', '화성에 간', '껌젖', '행복한', '불행한', '철학적인', '시큼한', '때리는',
  '음탕한', '훌륭한', '거대한', '약한', '강한', '풍성한', '탈모', '개추한',
  '비추한', '흥분한', '신기한', '현명한', '나른한', '저렴한', '비싼', '할인 중인',
  '실패한', '성공한', '불량재고', '인기 많은', '인기 없는', '괘씸한', '작은', '큰', '갤창', '으흐흐'
]

const roomModifiers = [
  '듣는', '안듣는', '사랑하는', '싫어하는', '트는', '틀어대는', '작곡하는', '감상하는',
  '연구하는', '씹어먹는', '먹이는', '포교하는', '즐기는', '모르는', '전문가인', '아는',
  '지듣노', '지금 듣는', '지금 안듣는', '멸망한', '개같이 듣는', '', '순항중인',
  '좋아하는', '잘 아는', '정말 좋아하는', '잘 모르는', '진짜 좋아하는', '못 먹는',
  '못 먹이는', '먹는', '잘 먹이는', '잘 먹는', '성공한', '잠수중인', '개추 박는',
  '비추 박는', '내일 들을', '인생', '안 트는', '잘 트는'
]

const vocaloids = [
  '메이코', '카이토', '미쿠', '린', '렌', '루카', '가쿠포', '구미', '릴리', '우나',
  '코토', '츠이나쨩', '유카리', '아카네', '아오이', '아카리', '유키', '이로하', '즌코', '즌다몬', 'VY1',
  'VY2', '게키야쿠', '카제히키', '카나데', '츠무기', '너스로봇', '마론', '시유', '유니', '마이카',
  '뤄톈이', 'IA', '옌허', '웨정링', '웨정룽야', '즈위모커', '모칭셴', '플라워', '히메', '미코토',
  '키리탄', '카후', '세카이', '리메', '코코', '하루', '리무루', '릿카', '마키', '모카',
  '카린', '치후유', '치세이', '우이', '테토', '데포코', '우사기', '츠루기', '레이', '소라',
  '후리모멘', '사요', '이타코'
]

const musicGenres = [
  '와풍', '레트로', '바로크', '일렉트로 스윙', '재즈', '컨템포러리 재즈', '라틴 음악', '인디 음악',
  '일렉트로 포크', '익스페리멘탈 팝', '유로팝', '유로비트', '엔카', '아카펠라', '메탈', '헤비메탈',
  '트롵', '하이퍼팝', '힙합', '프로그레시브 뮤직', '재즈 펑크', '공산주의 음악', '아트코어', '안티 팝',
  '월드비트', '네오포크', '노이즈', '뉴재즈', '데스코어', '컨트리', '웨스턴 스윙', '익스트림 메탈',
  '익스페리멘탈 음악', '전파곡', '칠 아웃', '칠웨이브', '매스 록', '멜로디컬 힙합', '라온지',
  '랩', '랩 록', '보타니카 음악', '컬러 팝', '발라드', '개버', '개러지', '경계곡',
  '사이키델릭 뮤직', '심포닉 메탈', '싱어송라이터', '파워 일렉트로닉스', '퓨처 코어', '퓨처 펑크', '퓨처 베이스',
  '트로트', 'Lo-Fi', 'R&B', '하드베이스', '어쿠스틱', '어쿠스틱 팝', '포에트리', '엽기',
  '우울', '고딕펑크', '비쥬얼계', '신도', '미스테리', '잔혹동화', '괴기', '가짜', '무대',
  '할로윈', '서커스', '재즈가요', '클래식', '합창곡', '동요', '피아노', '포스트 클래식컬', '챔버팝',
  '폭주 피아노팝', '피아노록', '팝 퓨젼', '프로그레시브', '변박자', '드럼 앤 베이스', '프로그레시브 록', '아이리쉬',
  '포크', '전통음악풍', '민족조', '레게', '스카', '찻집 록', '시부야계', '포스트 시부야계', '라운지팝',
  '불사의팝', '우타모노', '펑크팝', '피아노팝', '팝송', '악기 반주 팝록', '멀티 어레인지', 'AOR', '시티팝',
  '소울', 'xxxx 리스펙트', '디지털팝', '칩튠', '게임뮤직', '애니송', '배틀 애니메이션계', '게임송', '판타지계',
  '전통음악조', '아이돌송', '아이돌 그룹송', '나키게', '모에', '텍스트 코믹송', '뉴웨이브', '칠아웃 일렉트로니카',
  '앰비언트 일렉트로니카', '사운드 이펙트', '루프', '미니멀팝', '테크노 가요', '테크노팝', '일렉트로팝', '팝계 EDM',
  '록계 EDM', '글리치', '인더스트리얼', '브레이크 코어', '테크노', '하우스', '클럽 뮤직', '트랜스',
  '디스코', '댄스 뮤직', '디스코 록', '베이스 뮤직', '신스팝록', '댄스록', '고속 보카로 록', '팝 록 라이트',
  '팝 록 멜로우', '록계 퓨젼', '디지털 록', '기타 팝', '기타 록', '블루스', '로큰롤', '펑크 록',
  '가요 록', '라우드 록', '이모', '얼터너티브 록', '드림팝', '슈게이징', '포스트 록', '로파이 팝',
  '사이키델릭', '드론', '포에트리 리딩', '포엠코어', '믹스쳐', '샘플링 뮤직', '불협화음', '스트레인지 팝',
  '사운드 콜라주', '아방가르드'
]

const vocaloidProducers = [
  '쿠로우사기', '슈도', '제', '나키소', '마레츠', '유리이 카논', '샤', '테니오하', 'TOQUI', '하뉴 마이고',
  '히후미', '악의P', '유가미P', '쿠로우사P', '죠루진', 'natsuP', '히토시즈쿠P', '야마△', 'kanaria', 'GHOST',
  'Tatsugoo', '하치야 나나시', '쿠리야마 유리', '마치게리타', 'mayuko', 'LadyMonsters', 'wotaku', 'zensen', '츠쿠노', '토스',
  'Tonbi', '히이라기 키라이', '이마이유', '히야무기P', '고인쿄', '샤레오츠P', 'tarezo', '나캬무랴', '아쿠츠', '이메소라P',
  '마츠오카 코헤이', '키헤에', 'GYARI', '시와큐사이', 'deja음색', '도그마무시', '남유럽P', 'Man_boo', '텐류 류쇼', 'aripon',
  'Cloudia', '코토코토', '치카라', 'nowism', '키쿠오', '게로게', '사루온나', '덴노코P', '바부쨩', '페루모',
  '후지시마 하나', 'MONOTONE', '오바케P', '카니파', 'kamome', '큐리P', 'KutaMusicBox', '소우', '치카미 소우', 'torekuru',
  'Wato', 'X1gl', 'arEE', '데스페라', '테하타케', '토치', 'nina', '플러스라피스', '요', 'Loco',
  '수채P', '이노우츠하SA', '이요와', '콘니치 와토', '사다카케이', '유마메아네', '노스케', '이소노스케', 'Konon', '니시지마 손다이',
  '마카로리', 'Mealerrand', '밀에란드', '호시노 겐 팬', '이와코가시', '효무P', '빙몽P', '안개 사면체', 'Saku', 'treow',
  'ELECTROCUTICA', '불시말', '후시마츠', '쫄깃쫄깃한 빵', '야마시로 마시로', 'lumo', '누코카제', 'Nukogenome', 'Lemm', 'MCI_Error',
  '우케바코', 'cultist', 'k_zero+A', 'Yamato Kasai', 'HAMO', '팔치노', 'PELIE', '마모모', '크로와상 시카고',
  'collt', '사이로메', '테타레P', 'no8xf', 'whoo', '후쿠다 다이스케', '플라잉 지라프', 'Flying Giraffe', '후미도리P', '맥코이',
  '타카하시 마코토', '모리모토 유키노', '타카맷', '나시포포 다크', 'NahsiBoboDawg', '역시 로드리게스', '아스나로', '아나아니', 'linguo',
  '젠', '나태P', 'zendeiisi', '타비P', '여행P', 'tama', '이이즈카', 'nowhere man', '히키코', '모리오',
  '미키리 핫샤P', '즉시출발P', 'mi_ki_ri', 'm.moriz0', '메멘토', '모리조', 'siberia', '사사키 아츠시', 'Shibayan', '스타라이트P',
  '소립자49', 'Taroon', '나쿠나쿠', 'Feltmodeneo', 'FALL', '호루P', '베코', 'betcha', '아라타 마이코', 'OSTER project',
  '키사라', '키츠네리', '구미야마', 'N-Roach', '코미야 커피', '치에P', '미즈카미 치에', '네무', '구름 수집업자', '후와P',
  '스토리', '모치우츠네', '야마기시 코우지', '아카사카응응응', '이와이', '우사기하라 쿄무코', '스나메리', '나누리소', '하루카와 하싯코', '다쿠챠',
  '후루마 카모메', 'Doten', '100회 구토', '후나코시P', '유즈키 나나메', '이니마나미', '시카 아루쿠', '스코프', 'tezzy', 'nwnw',
  '모형정원 궤도', '표류 유리', '효류 가라스', '퐁뇌프', '모소모소P', '아야나', 'Conslo', '젠자와', '단토', 'danto',
  '나노리타', '아오키 고우', '오후 티', '야메쨩', 'miyazaki kazuya', '카사무라 토타', '카랏피', 'kaku', '칸자키 이오리', '하야시 케이',
  'KEI', '하리하라 츠바사', 'HarryP', '후라이P', 'suniikar', '무사타', '헤르니아', '시온', '쿠네루', 'Q\'nel',
  '트라볼타', '나츠시로 타카아키', '니오P', 'HoneyWorks', '하니와', 'halyosy', '하루요시', '후와리P', '욘쥬P', '40mP',
  '이나메 토오루', 'ikomai', 'sabio', '타카무라 후타', 'shikisai', '막과자O형', '다가시O가타', '니죠', 'em_es',
  'oka', 'oharanko', '은하방면P', '세가와 토오루', 'torusegawa', '세라', 'chiquewa', '치쿠와', '토모P', '벳코',
  '나츠조라P', '여름하늘P', '메로쿠루', 'R Sound Design', 'Ayase', 'YOASOBI', '말하는 모자', 'Shabo', '숀',
  '스즈키 쇼타', '시로문', '왓코', '챠리켄P', '야스다 챠리켄', '미넷쿠', 'MineK', '레이라무루', 'cat nap', '고부스',
  'GoBS', '사토 소이소스', 'Shake Sphere', '사케P', 'DATEKEN', 'Dixie_Flatline', '델타', '파트리체프', '폴리스 피카딜리',
  '유기산', '카미야마 요우', '우미챠', '허상', 'Green wisteria', '쿠로뮴', '스베아나', '모두 당신 탓입니다', '토리피요', '나츠게',
  '9Q', 'sakamotonorok', '시마', '시타', 'NY', 'nostalgia2', 'Hanzaki', 'x0o0x_', '와카메', 'r',
  '사토 노코', '스야마', '전기고래', 'NMKK', '나메키카', '와카메아이스', '니호시카', '후로쿠로', 'frog96', '유쿠에왓토',
  '우이', 'sasakure.UK', '사사쿠레', '사타나', 'citrus', '텐키', '돗P', 'negoto', 'Odd', 'task',
  'supertaskmusic', '나나호시 관현악단', '이와미 타카시', 'you맨', '아이이로 니시몬', '오리이베 코피', 'kemu', '케무', '호리에 쇼타',
  '나카무라 이네', '코스게 곤약', '사이토 유우키', 'cosMo', '폭주P', '진', '자연의적P', 'yusukeP', '유유P', 
  'ryo', 'supercell', 'Fty', 'coha', 'IRON신노스케Jr', '시안 키노', 'Cyan Kino', 'Sceno Ichiro', '세노 이치로',
  'SeikoP', 'PeriTune', '무츠키 세이', '유작P', 'kairu', '사토이모', '천보석P', '세나 와타루', 'todoP', '유키노 이토',
  '반탄스', 'LUNA', '레거시', '롱게스트', 'Omoi', '오와타P', '카를로스 하카마다', '사이제P', '키노시타', '데드볼P',
  '마다코', '마후마후', '미나미노 미나미', 'MIMI', 'Last Note', '라스노', '개복치P', '집 뒤에는 개복치가 죽어있다', '키무라 와이P',
  '토마두부', '나미구루', 'namigroove', '호보니치P', '마키시 우쿄', '마루킨', '난수P', 'anomimi', 'MTXO', '캡틴 미라이',
  '캡미라P', '코 야스코', '스이덴 안노', '사이토 쿠로네코야', 'konkon', 'DoT군', 'Nogirroute', '피노키오피', '푸니마루',
  'SOMIACHAN', '모루P', 'MOL', '이마사라P', 'yama-dai', '에나구루후', '우키요P', 'wtnb', '공중 루사', 'quoree',
  '쿠오리', '페더 밈', 'Elitetao', 'piptotao', 'kusegumi', 'hinoneh', 'pei', '유우키쨩', '긴급 유로포트',
  '쿠로에Daphnis', '콘페이토P', '별사탕P', 'competor', 'sansui', '야마다 미즈호', '비엔', '후노니카', '미미미에나', '메만지',
  'daniwellP', '마시마 유로', '야스미 스야', '유코피', '라마즈P', 'LamazeP', '고지마지P',  '에샤', '오이쨩',
  '쿠누스P', 'SH100000', '자동필기', '다나카 카즈오', '펠리컨 동기', '미나미 사키', '알쿠레무', 'r-906',
  '아오리스', 'Alpaca', 'Tsukasa Ichimura', 'emon', 'Tes', 'kz', 'livetune', '사노 카모메', '스즈메노메',
  'temporu', '나카노는 4번', 'nakano4', 'Namitape', 'wateraqua', '아에루', '아루쿠히토', 'ukaihi', '오시바 광맥',
  'gaburyu', '쿠잇쿠', 'qqぃqq', '색즉시몽', '하코', '하코모리', 'higma', '미야자와 모요요', 'KAIRUI', 'CleanTears',
  'CT', '마사후미', 'keisei', 'TKN', '톳쿤', '23.exe', 'BIGHEAD', 'ftrygry', '후타리요가리', 'nu_imi',
  '아메오토코', '페드로', 'Pedlo', 'old ePilogue', 'yuichi NAGAO', '로보', '이소', '카메리아', '오오야 마사야',
  '기가P', 'KIRA', 'Yusukekira', '사츠키', '32ki', 'Guiano', 'Circus-P', 'matt9five', 'DoofusP', 'STEAKA',
  '스테아카', 'DIVELA', '히이라기 마그네타이트', '유리루', 'auauo', '이오기 료', '오시카이', 'd.j.아네이로', '하라구치 사스케',
  '미나가와 오보루', '모에 sabetsu', '요루카자미', 'mnmnmnmn 에무에누', '회전 타원체', '죽어버린 안구', '세피아 레코더즈', 'sepiarecorders',
  'SOOOO', '소우', 'solidsmoke', 'ATOLS', 'ALUVI', 'IllMia', '이루P', 'kiichi', '난토카P', '네무노키',
  '다이후쿠P', '찹쌀떡P', 'Ohnuma', '치타걸P', '히로세 코타로', 'Dong', '하이네켄P', 'fatP', '아루카P', 'M@SATOSHI',
  '카시이 모이미', '고분P', 'samfree', '대막파신', '다이바쿠 하신', 'tripshots', '나유타P', 'NAYUTA', '하나소멘P',
  '칸자키 히로', '카고메P', '소라쿠라게', '하늘해파리', 'take_coke', '시도 타쿠토', 'Mitchie M', '미치엠', 'littlebylittle',
  '아오와이파이', '코우시', '나유탄 성인', '바미즈', '마사라다', '그란피아', '하야사카 타카유키', 'poncanism', 'mizumaya',
  'orangestar', '미완성P', 'keeno', '시이나 모타', '포와포와P', '지그', '샤논', '토아', 'n-buna', '나부나',
  '요루시카', '하루마키고항', 'Project Lumina', 'Misumi', 'DUSTCELL', 'Eve', 'A4', 'tadano kaede', 'kojika',
  '시쿤', 'seeeeecun', 'john', 'TOOBOE', '스리이', '니루카지츠', 'NILFRUITS', '누유리', 'Lanndo', '하치',
  '요네즈 켄시', '벌룬', '스다 케이나', '스즈리', 'szri', '츠미키', 'NOMELON NOLEMON', '토마', 'Gyoson',
  'Neru', '양지전공', '레루리리', '로쿠로', '오와카', '히토리에', 'wowaka', 'ASIMO', 'KAZUYA', '타케키노코',
  '쿠소이나카P', '지미섬P', 'OneRoom', 'Chinozo', '치노조', '히라기', '시지마 카이세이', '덴포루P', 'koyori',
  '나노우', '코야마 히데카즈', '미키토P', 'yakiurazzz', '야키우라즈', 'yukkedoluce', '윳케돌체', 'EZFG', '이네',
  'INE', 'Saza7U3', '사자나미', 'Sebon', 'ZEROKU', 'Talich Helfen', 'V/R Converters', '오카유', 'yusukeeeokayu',
  '타카히로', 'starchots', '____natural', 'Bumleku', 'Vader', 'yu_koro', 'Mizore', 'liam', '카사하라 히데츠구',
  '6호차', '이나바 쿠모리', '카이리키 베어', '안녕하세요 타니타씨', '키타니 타츠야', 'jon-YAKITORY', 'jon', '데코니나',
  'DECO*27', '나모나키P', 'B･D･A', '광수용', '광수용의 창고', '호노', '마이갓P', 'G9Fried@GRM', '사사가와 마오',
  'mao sasagawa', '이소P', '스요', '니니히', '아오오니', '해치포치P', 'ハッチポッチP', '아카이 타닌', '새빨간 남',
  '수국꽃 합창단', '아지사이 합창단', '이시후로', '아사히 렌', '네크라이 토키', '큐', 'Qui_91', 'tonae', '지샤쿠',
  '나시모토P', '나시모토 우이', '나스', '인간 도그', '헤토반P', 'mal-', '오카메P', '갈비 타로', 'otetsu',
  '고보우멘', 'sleepless', 'dakara', '다나카B', '비밀의 피어스', 'Pencil', '안야호', 'annyahoo', '우츠P',
  '안구P', 'niki', '바스도라렌다P', '베이스드럼 연타P', '우지', 'Uji', 'uzP', '유우지', '유요윳페',
  'ROY', '나츠노오와리', '여름의 끝', '이이', '우시오', 'kawato', '툰베르크관', 'neL', '매일밤P', '마이요P',
  '모리', '아사쿠라 신', '유루후와 보브걸', 'yullfuwa bobu girl', '애널버진P', '아부라야 다이한세이', '기름집 대번성', '오키시 진',
  '카니센', '하이이로야', '잿빛 집', '안닌', '옥쇄 고양이', '교쿠사이 네코', '시란P', '816', '1990',
  '구루구루P', 'gurupon', 'DS_8', 'NIYMORIY', 'A_II', 'REIONN_IV', 'bothneco', 'ypl', '어브노멀 아보카도',
  'inuha', 'wintermute', 'AIR다F', '에아다에후', 'kinoue64', '심야의 톱', '신야노 노코기리', '마에카와 페소', '몽환전영',
  '야나기', '유', 'acane_madder', 'gomez', 'sea-no', '타구치 사키', '건반무쌍P', '네코볼로', '사사노말리',
  '하루노', '후루카와 혼포', '후루카와P', '후루카와 료', 'm.o.e', 'm.tomi', 'ondo', 'kondo', 'Schoolmizzy',
  'ちるり', 'とろぉりぃ', 'nagatsuta', 'Puhyuneco', 'HVNC', 'ishi12', '우키네무루', 'Kiyu', '키유', '후와 키유',
  '전자동 무대륙', 'daluy', '타노토리', '니시마와시', 'FuzzP', 'ManHoleMan', 'YARUSE NAKIO', 'amahisa', 'ukiyojingu',
  '오카상', '코무기 쟈무', '밀 잼', '하나레기 카나', '하니와', '아메리카 민요 연구회', 'E히사쿤', '아오야 나츠키',
  '이하쿠시', '원반P', '스즈나리', 'Torero', '야나가 미유키', 'yanagamiyuki', 'MSS 사운드 시스템', '신카 미야비', '스즈키 오우',
  '하이요리 코', '야코 우메', '야행 매화', '야마모토 뉴', '안도 나레도', 'Undo Redo', 'yeahyoutoo', 'snsn',
  '오키나', '중2병P', 'baboo', 'period', '츠치야마 시구레', '미즈노에 미조레', '미츠바치P', '꿀벌P', '아메카',
  '우타카타P', '물거품P', 'ORII', 'F도어', 'Fdur', '다이죠부P', '괜찮아P', '타노시이마구로댄스P', '즐거운 참치 댄스P', '힐링P',
  'MC_PEACETIME', '힛키P', '오오타카 토모오키', 'poporun', 'po9o2un'
]

function getRandomItem<T>(array: T[]): T {
  return array[Math.floor(Math.random() * array.length)]
}

function getRandomRoomPrefix(): string {
  const totalLength = musicGenres.length + vocaloids.length + vocaloidProducers.length
  const index = Math.floor(Math.random() * totalLength)

  if (index < musicGenres.length) {
    return musicGenres[index]
  } else if (index < musicGenres.length + vocaloids.length) {
    return vocaloids[index - musicGenres.length]
  } else {
    return vocaloidProducers[index - musicGenres.length - vocaloids.length]
  }
}

export function generateRoomName(): string {
  const prefix = getRandomRoomPrefix()
  const modifier = getRandomItem(roomModifiers)
  return modifier === '' ? `${prefix} 망호` : `${prefix} ${modifier} 망호`
}


export function generateUsername(): string {
  const modifier = getRandomItem(nicknameModifiers)
  const vocaloid = getRandomItem(vocaloids)

  return `${modifier} ${vocaloid}`
}
